results/1/server1/Spock-0.6.5.0/AFTER_DEEP.log
Benchmarking AFTER_DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.01ms   11.03ms 282.85ms   83.30%
    Req/Sec    12.45k     3.00k   20.09k    65.53%
  729018 requests in 30.00s, 103.59MB read
  Socket errors: connect 0, read 0, write 0, timeout 321
Requests/sec:  24300.70
Transfer/sec:      3.45MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.71ms   12.50ms   1.16s    92.68%
    Req/Sec    13.15k     2.32k   17.44k    69.53%
  779587 requests in 30.00s, 110.78MB read
Requests/sec:  25983.84
Transfer/sec:      3.69MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.15ms   21.09ms   1.37s    98.61%
    Req/Sec    12.99k     2.94k   23.00k    72.00%
  763903 requests in 30.00s, 108.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 460
Requests/sec:  25463.31
Transfer/sec:      3.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.74ms   12.52ms 715.52ms   89.89%
    Req/Sec    12.13k     2.68k   16.50k    63.12%
  716105 requests in 30.00s, 101.76MB read
Requests/sec:  23870.02
Transfer/sec:      3.39MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.69ms   13.20ms   1.06s    90.69%
    Req/Sec    12.37k     2.55k   19.53k    60.39%
  733660 requests in 30.00s, 104.25MB read
  Socket errors: connect 0, read 0, write 0, timeout 61
Requests/sec:  24454.74
Transfer/sec:      3.47MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.79ms   50.54ms   1.71s    99.84%
    Req/Sec    13.00k     3.24k   22.22k    69.33%
  762898 requests in 30.00s, 108.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 438
Requests/sec:  25429.07
Transfer/sec:      3.61MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.78ms   48.29ms   1.97s    99.89%
    Req/Sec    12.95k     3.35k   22.45k    68.24%
  758434 requests in 30.00s, 107.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 330
Requests/sec:  25280.98
Transfer/sec:      3.59MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.50ms   37.91ms   1.77s    99.91%
    Req/Sec    13.10k     3.11k   21.68k    66.50%
  767558 requests in 30.00s, 109.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 117
Requests/sec:  25585.35
Transfer/sec:      3.64MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.82ms   20.26ms   1.89s    97.65%
    Req/Sec    12.96k     2.41k   17.41k    69.86%
  763334 requests in 30.00s, 108.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 127
Requests/sec:  25444.12
Transfer/sec:      3.62MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/after
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.44ms   23.26ms   1.93s    98.75%
    Req/Sec    12.88k     3.09k   24.90k    70.31%
  759528 requests in 30.00s, 107.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 53
Requests/sec:  25317.28
Transfer/sec:      3.60MB
=================== summary ===================
machine:      server1
ghc version:  7.8.2
bench target: Spock-0.6.5.0
bench:        AFTER_DEEP
bench mode:   30s * 10
average:      25112.94
stdev:        668.48
=================== oneline ===================
server1,7.8.2,Spock-0.6.5.0,AFTER_DEEP,30s,10,25112.94,668.48